[{"categories":["cloud native"],"date":1533958656,"description":"Today I am honored to announce that I have become a CNCF Ambassador.","image":"https://jimmysong.ioimages/banner/cncf-ambassador.webp","objectID":"988ed799c4db425b97891523c5c0ec49","permalink":"https://jimmysong.io/en/blog/cloud-native-and-me-the-past-current-and-future/","summary":"Today I am honored to announce that I have become a CNCF Ambassador . Here is my story with Cloud Native. Origin The first time to attend the Cloud Native Computing Foundation is at the LC3 in Beijing 2017. I attended the meeting again this year, and in November of this year, CNCF will hold the KubeCon \u0026amp; CloudNativeCon for the first time in Shanghai, China. I\u0026rsquo;ll be there too. Cloud Native Books My origins with the Cloud Native is originated from Kevin Hoffman\u0026rsquo;s book Cloud Native Go . I translated this book at the end of 2016. Since then,","tags":["cncf"],"title":"Cloud Native and me - the past, current and future"},{"categories":["Open Source"],"date":1547809574,"description":"A standalone Kubernetes and Istio environment with Docker on you own laptop","image":"https://jimmysong.ioimages/banner/sandbox.jpg","objectID":"176c1061cda3fb8c5b0b5ddbb4ddcb48","permalink":"https://jimmysong.io/en/blog/cloud-native-sandbox/","summary":"Github: https://github.com/rootsongjc/cloud-native-sandbox Cloud Native Sandbox can help you setup a standalone Kubernetes and istio environment with Docker on you own laptop.\nThe sandbox integrated with the following components:\n Kubernetes v1.10.3 Istio v1.0.4 Kubernetes dashboard v1.8.3  Differences with kubernetes-vagrant-centos-cluster As I have created the kubernetes-vagrant-centos-cluster to set up a Kubernetes cluster and istio service mesh with vagrantfile which consists of 1 master(also as node) and 3 nodes, but there is a big problem that it is so high weight and consume resources. So I made this light weight sandbox.\nFeatures\n No VirtualBox or Vagrantfile required Light weight High speed, low drag Easy to operate  Services","tags":["kubernetes","istio"],"title":"Cloud Native Sandbox"},{"categories":["cloud native"],"date":1505478767,"description":"Kevin Hoffman address that 15 Factors of Cloud Native.","image":"https://jimmysong.ioimages/banner/kevin-hoffman-t11.webp","objectID":"1ea74dcb21a7e6fbda1d7ed89565a75a","permalink":"https://jimmysong.io/en/blog/high-level-cloud-native-from-kevin-hoffman/","summary":"Kevin Hoffman(From Capital One, twitter @KevinHoffman ) was making a speech on TalkingData T11 Smart Data Summit. He addressed that 15 Factors of Cloud Native which based on Heroku\u0026rsquo;s original Twelve-Factor App , but he add more 3 another factors on it. Let\u0026rsquo;s have a look at the 15 factors of Cloud Native. 1. One codebase, one App Single version-controlled codebase, many deploys Multiple apps should not share code Microservices need separate release schedules Upgrade, deploy one without impacting others Tie build and deploy pipelines to single codebase 2. API first Service ecosystem requires a contract Public API Multiple teams","title":"High Level Cloud Native From Kevin Hoffman"},{"categories":["Istio"],"date":1652595520,"description":"This article will guide you on how to compile the Istio binaries on macOS.","image":"https://jimmysong.ioimages/banner/build-istio.webp","objectID":"cb1e6f2024eba4d0bfd6edf1a022479c","permalink":"https://jimmysong.io/en/blog/how-to-build-istio/","summary":"This article will guide you on how to compile the Istio binaries and Docker images on macOS.\nBefore you begin Before we start, refer to the Istio Wiki , here is the information about my build environment.\n macOS 12.3.1 Darwin AMD64 Docker Desktop 4.8.1(78998) Docker Engine v20.10.14  Start to compile First, download the Istio code from GitHub to the $GOPATH/src/istio.io/istio directory, and execute the commands below in that root directory.\nCompile into binaries Execute the following command to download the Istio dependent packages, which will be downloaded to the vendor directory.\ngo mod vendor Run the following command to build Istio:","tags":["istio"],"title":"How to build Istio?"},{"categories":["istio"],"date":1625494920,"description":"This article explains three patterns/tools for debugging microservices in Kubernetes and the changes brought by the introduction of Istio for debugging microservices.","image":"https://jimmysong.io/images/banner/scaled.jpg","objectID":"200d371631a86a888bac85875f092d92","permalink":"https://jimmysong.io/en/blog/how-to-debug-microservices-in-kubernetes-with-proxy-sidecar-or-service-mesh/","summary":"Kubernetes is arguably the best environment for running microservices so far, but the experience of debugging microservices in a Kubernetes environment may not be as user-friendly. This article will show you how to debug microservices in Kubernetes, introduce common tools, and explain how the introduction of Istio impacts debugging microservices.\nDebugging microservices is vastly different from traditional monolithic applications The debugging of microservices has been a long-standing problem for software developers. This challenge does not exist in traditional monolithic applications because developers can leverage the debugger in IDEs to add breakpoints, modify environment variables, single-step execution, etc. for their applications, all of which provide great help in software debugging.","tags":["istio","service mesh","telepresence","nocalhost"],"title":"How to debug microservices in Kubernetes with proxy, sidecar or service mesh?"},{"categories":["Istio"],"date":1604306607,"description":"Better integration of virtual machine-based workloads into the service mesh is a major focus for the Istio team this year, and Tetrate also provides seamless multi-cloud connectivity, security and observability, including for virtual machines, through its product Tetrate Service Bridge. This article will show you why Istio needs to integrate with virtual machines and how.","image":"https://jimmysong.ioimages/banner/istio-logo.webp","objectID":"ac0050ad556dd1bfce8bbaa866099d4e","permalink":"https://jimmysong.io/en/blog/how-to-integrate-virtual-machines-into-istio-service-mesh/","summary":"Istio is a popular service mesh to connect, secure, control, and observe services. When it was first introduced as open source in 2017, Kubernetes was winning the container orchestration battle and Istio answered the needs of organizations moving to microservices. Although Istio claims to support heterogeneous environments such as Nomad, Consul, Eureka, Cloud Foundry, Mesos, etc., in reality, it has always worked best with Kubernetes — on which its service discovery is based.\nIstio was criticized for a number of issues early in its development, for the large number of components, the complexity of installation and maintenance, the difficulty of debugging, a steep learning curve due to the introduction of too many new concepts and objects (up to 50 CRDs), and the impact of Mixer components on performance.","title":"How to Integrate Virtual Machines into Istio Service Mesh"},{"categories":["Istio"],"date":1605775407,"description":"WorkloadGroup is a new API object. It is intended to be used with non-Kubernetes workloads like Virtual Machines and is meant to mimic the existing sidecar injection and deployment specification model used for Kubernetes workloads to bootstrap Istio proxies.","image":"https://jimmysong.ioimages/banner/istio18.jpg","objectID":"e9933fccfc8df30cac30d1f811687aaa","permalink":"https://jimmysong.io/en/blog/istio-1-8-a-smart-dns-proxy-takes-support-for-virtual-machines-a-step-further/","summary":"1.8 is the last version of Istio to be released in 2020 and it has the following major updates:\n Supports installation and upgrades using Helm 3. Mixer was officially removed. Added Istio DNS proxy to transparently intercept DNS queries from applications. WorkloadGroup has been added to simplify the integration of virtual machines.  WorkloadGroup is a new API object. It is intended to be used with non-Kubernetes workloads like Virtual Machines and is meant to mimic the existing sidecar injection and deployment specification model used for Kubernetes workloads to bootstrap Istio proxies.\nInstallation and Upgrades Istio starts to officially support the use of Helm v3 for installations and upgrades.","title":"Istio 1.8: A Smart DNS Proxy Takes Support for Virtual Machines a Step Further"},{"categories":["service mesh"],"date":1611361637,"description":"In this article, I’ll give you an overview of Istio‘s history of virtual machine integration support. In particular, the introduction of the smart DNS proxy and WorkloadGroup in Istio 1.8, which makes virtual machines and containers equivalent at the resource abstraction level.","image":"https://jimmysong.ioimages/banner/vm.webp","objectID":"a0232cb5bf44f43bbfff830200daaeef","permalink":"https://jimmysong.io/en/blog/istio-18-a-virtual-machine-integration-odyssey/","summary":"In this article, I’ll give you an overview of Istio ‘s history of virtual machine integration support. In particular, the introduction of the smart DNS proxy and WorkloadGroup in Istio 1.8, which makes virtual machines and containers equivalent at the resource abstraction level.\nI will show you a tumultuous odyssey of Istio’s virtual machine integration. Tetrate, the enterprise service mesh company that made pushing Istio to run everywhere part of its founding mission, has used VM features extensively in customer deployments and has been instrumental in pushing VMs to Istio upstream.\nPreface In my previous article , I talked about how Istio 1.","title":"Istio 1.8: A Virtual Machine Integration Odyssey"},{"categories":["service mesh"],"date":1621814400,"description":"Today is Istio's 4 year birthday, let’s take a look back at Istio’s four years of development — and look forward to Istio’s future.","image":"https://jimmysong.io/images/banner/istio-4-year-birthday.jpg","objectID":"c4e6b4b4e5827b45719003403dff2958","permalink":"https://jimmysong.io/en/blog/istio-4-year-birthday/","summary":"Istio was named by Tetrate founder Varun Talwar and Google lead engineer Louis Ryan in 2017 and was open sourced on May 24, 2017. Today is the fourth anniversary of Istio’s open source arrival. Let’s take a look back at Istio’s four years of development — and look forward to Istio’s future.\nIstio’s open source history In 2017, the year Kubernetes ended the container orchestration battle, Google took the opportunity to consolidate its dominance in the cloud native space and compensate for Kubernetes’ disadvantage in service-to-service traffic management by open-sourcing Istio. Istio released its 1.10 last week — but here are some of the most important releases in Istio’s history to date.","tags":["kubernetes","istio","service mesh"],"title":"Happy Istio 4th Anniversary -- Retrospect and Outlook"},{"categories":["Istio"],"date":1651976320,"description":"This article will introduce you to the various ports and functions of the Istio control plane and data plane.","image":"https://jimmysong.ioimages/banner/istio-ports.webp","objectID":"8ee023b1b7c80c2f0a132f9d31bc8435","permalink":"https://jimmysong.io/en/blog/istio-components-and-ports/","summary":"In my last two blogs:\n Sidecar injection, transparent traffic hijacking , and routing process in Istio explained in detail  Traffic types and iptables rules in Istio sidecar explained   I gave you a detailed overview of the traffic in the Istio data plane, but the data plane does not exist in isolation. This article will show you the ports and their usages for each component of both the control plane and data plane in Istio, which will help you understand the relationship between these flows and troubleshoot them.\nOverview Firstly, I will show you a global schematic. The following figure shows the components of a sidecar in the Istio data plane, and the objects that interact with it.","tags":["istio","sidecar"],"title":" Istio component ports and functions in detail"},{"categories":["Istio"],"date":1641804207,"description":"In this article, I’ll introduce you two Istio extension projects: Aeraki and Slime.","image":"https://jimmysong.ioimages/banner/areaki-and-slime.jpg","objectID":"b9ad5e436832eadb1d328c62671efef6","permalink":"https://jimmysong.io/en/blog/istio-extensions-slime-and-aeraki/","summary":"It’s been more than four years since Istio launched in May 2017, and while the project has had a strong following on GitHub and 10+ releases, its growing open-source ecosystem is still in its infancy.\nRecently added support for WebAssembly extensions has made the most popular open source service mesh more extensible than ever. This table lists the open-source projects in the Istio ecosystem as of November 11, 2021, sorted by open-source date. These projects enhance the Istio service mesh with gateways, extensions, utilities, and more. In this article, I’ll highlight the two new projects in the category of extensions.","tags":["istio","service mesh","aeraki","slime"],"title":"Introducing Slime and Aeraki in the evolution of Istio open-source ecosystem"},{"categories":["Istio"],"date":1652354320,"description":"This article will explain Istio's Init container, Pod internal processes and the startup process.","image":"https://jimmysong.ioimages/banner/istio-pod-process-lifecycle.webp","objectID":"1b468062c27d50fec5bda44cbdc2fc90","permalink":"https://jimmysong.io/en/blog/istio-pod-process-lifecycle/","summary":"This article will explain:\n The sidecar auto-injection process in Istio The init container startup process in Istio The startup process of a Pod with Sidecar auto-injection enabled  The following figure shows the components of a Pod in the Istio data plane after it has been started.\n  Istio data plane pod  Sidecar injection in Istio The following two sidecar injection methods are available in Istio.\n Manual injection using istioctl. Kubernetes-based mutating webhook admission controller automatic sidecar injection method.  Whether injected manually or automatically, SIDECAR\u0026rsquo;s injection process follows the following steps.\n Kubernetes needs to know the Istio cluster to which the sidecar to be injected is connected and its configuration.","tags":["istio","sidecar"],"title":"Istio data plane pod startup process explained"},{"categories":["Istio"],"date":1655296069,"description":"In-Depth Understanding of Istio - Advanced Practice of Cloud Native Service Mesh, the book is officially on sale!","image":"https://jimmysong.ioimages/banner/istio-book-en.webp","objectID":"1dc60d80da75100947fe0c759751cbda","permalink":"https://jimmysong.io/en/blog/istio-service-mesh-book/","summary":"It\u0026rsquo;s been more than 5 years since Google, IBM, and Lyft unveiled the Istio open source project in May 2017. The Istio project has developed from a seed to a tall tree in these years. Many domestic books on the Istio service mesh were launched in the two years following the release of Istio 1.0 in 2018. My country is at the forefront of the world in the field of Istio book publishing.\nService mesh: one of the core technologies of cloud native Today, Istio is nearly synonymous with service mesh in China. The development of service mesh, as one of the core cloud-native technologies described by CNCF (Cloud Native Computing Foundation), has gone through the following stages.","tags":["Istio","Service Mesh"],"title":"In-Depth Understanding of Isito: Announcing the Publication of a New Istio Book"},{"categories":["istio"],"date":1628216520,"description":"What is the relationship between the service mesh and the API gateway? How does Istio’s gateway work? What are the ways to expose the services in the Istio mesh? This article gives you the answer.","image":"https://jimmysong.io/images/banner/istio-service-mesh-api-gateway.jpg","objectID":"c91e4884c465daf442bdf3c38e566940","permalink":"https://jimmysong.io/en/blog/istio-servicemesh-api-gateway/","summary":"API gateways have been around for a long time as the entry point for clients to access the back-end, mainly to manage “north-south” traffic, In recent years, service mesh architectures have become popular, mainly for managing internal systems,(i.e. “east-west” traffic), while a service mesh like Istio also has built-in gateways that bring traffic inside and outside the system under unified control. This often creates confusion for first-time users of Istio. What is the relationship between the service mesh and the API gateway? How does Istio’s gateway work? What are the ways to expose the services in the Istio mesh? This article gives you the answer.","tags":["istio","service mesh","kuberentes","api gateway"],"title":"Using Istio service mesh as API Gateway"},{"categories":["Istio"],"date":1651893520,"description":"This article will show you the six traffic types and their iptables rules in Istio sidecar, and take you through the whole diagram in a schematic format.","image":"https://jimmysong.ioimages/banner/istio-iptables.webp","objectID":"b584854d5fd76194c90f166b6acc77e2","permalink":"https://jimmysong.io/en/blog/istio-sidecar-traffic-types/","summary":"As we know that Istio uses iptables for traffic hijacking, where the iptables rule chains has one called ISTIO_OUTPUT, which contains the following rules.\n   Rule target in out source destination     1 RETURN any lo 127.0.0.6 anywhere   2 ISTIO_IN_REDIRECT any lo anywhere !localhost owner UID match 1337   3 RETURN any lo anywhere anywhere !owner UID match 1337   4 RETURN any any anywhere anywhere owner UID match 1337   5 ISTIO_IN_REDIRECT any lo anywhere !localhost owner GID match 1337   6 RETURN any lo anywhere anywhere !owner GID match 1337   7 RETURN any any anywhere anywhere owner GID match 1337   8 RETURN any any anywhere localhost   9 ISTIO_REDIRECT any any anywhere anywhere    The sidecar applies these rules to deal with different types of traffic.","tags":["istio","sidecar","iptables"],"title":"Traffic types and iptables rules in Istio sidecar explained"},{"categories":["private"],"date":1598833637,"description":"Today is my last day at Ant and tomorrow I'm starting a new career at Tetrate.","image":"https://jimmysong.io/images/banner/new-beginning.jpg","objectID":"e9752495932f7d7bf8e878396816af4b","permalink":"https://jimmysong.io/en/blog/moving-on-from-ant-group/","summary":"Today is my 914th day and also the last day with Ant Group , tomorrow is September 1st, which is usually the day school starts, and everyone at Alibaba is known as \u0026ldquo;classmate\u0026rdquo;, tomorrow I will join Tetrate , and that\u0026rsquo;s kind of starting my new semester!\nAnt/Alibaba and the Cloud Native Community To date, Ant/Alibaba Group has had a profound impact on my career, especially its corporate culture and values, and the Alibaba recruiting philosophy of \u0026ldquo;finding like-minded people\u0026rdquo;, and isn\u0026rsquo;t the process of creating the Cloud Native Community also a process of finding like-minded people? Cloud Native Community is like a small society, I don\u0026rsquo;t want it to have much social value, but only want it to make a small but beautiful change to individuals, to enterprises and to society.","title":"New Beginning - Goodbye Ant, Hello Tetrate"},{"categories":["istio"],"date":1626099720,"description":"This article explains three patterns/tools for debugging microservices in Kubernetes and the changes brought by the introduction of Istio for debugging microservices.","image":"https://jimmysong.io/images/banner/multicluster.webp","objectID":"122ec3e2bf50865c2c960c4a37b4e869","permalink":"https://jimmysong.io/en/blog/multicluster-management-with-kubernetes-and-istio/","summary":"Do you have multiple Kubernetes clusters and a service mesh? Do your virtual machines and services in a Kubernetes cluster need to interact? This article will take you through the process and considerations of building a hybrid cloud using Kubernetes and an Istio Service Mesh. Together, Kubernetes and Istio can be used to bring hybrid workloads into a mesh and achieve interoperability for multicluster. But another layer of infrastructure — a management plane — is helpful for managing multicluster or multimesh deployments.\nKubernetes Using Kubernetes enables rapid deployment of a distributed environment that enables cloud interoperability and unifies the control plane on the cloud.","tags":["istio","service mesh","kuberentes","tsb","multicluster"],"title":"Multicluster Management with Kubernetes and Istio"},{"categories":["Service Mesh"],"date":1639298607,"description":"This article will explore the relationship between service mesh and cloud native.","image":"https://jimmysong.ioimages/banner/service-mesh-banner-bg.jpg","objectID":"bd0868942ef2cb6a47fc507898cdfcf3","permalink":"https://jimmysong.io/en/blog/service-mesh-an-integral-part-of-cloud-native-apps/","summary":"If you don’t know what Istio is, you can read my previous articles below:\n What Is Istio and Why Does Kubernetes Need it?  Why do you need Istio when you already have Kubernetes?   This article will explore the relationship between service mesh and cloud native.\nService mesh – the product of the container orchestration war If you’ve been following the cloud-native space since its early days, you’ll remember the container orchestration wars of 2015 to 2017. Kubernetes won the container wars in 2017, the idea of microservices had taken hold, and the trend toward containerization was unstoppable.","tags":["istio","service mesh","cloud native"],"title":"Service Mesh - an integral part of cloud-native applications"},{"categories":["Service Mesh"],"date":1641977007,"description":"A review of the development of Service Mesh in 2021.","image":"https://jimmysong.ioimages/banner/y2021.webp","objectID":"3e51172551e4b082d6e19f1fa74640a1","permalink":"https://jimmysong.io/en/blog/service-mesh-in-2021/","summary":"As the service mesh architecture concept gains traction and the scenarios for its applications emerge, there is no shortage of discussions about it in the community. I have worked on service mesh with the community for 4 years now, and will summarize the development of service mesh in 2021 from this perspective. Since Istio is the most popular service mesh, this article will focus on the technical and ecological aspects of Istio.\nService mesh: a critical tech for Cloud Native Infrastructure As one of the vital technologies defined by CNCF for cloud native, Istio has been around for five years now.","tags":["istio","service mesh","cloud native"],"title":"Service Mesh in 2021: the ecosystem is emerging"},{"categories":["Service Mesh"],"date":1585713364,"description":"This article is a rework of previously written content and is included in the Istio Handbook of the ServiceMesher community . Other chapters are still being compiled.","image":"https://jimmysong.ioimages/banner/era.webp","objectID":"1ff4f6fa0ef39a9952d178acef4caba2","permalink":"https://jimmysong.io/en/blog/service-mesh-the-microservices-in-post-kubernetes-era/","summary":"This article is a rework of previously written content and is included in the Istio Handbook of the ServiceMesher community . Other chapters are still being compiled. People who have just heard of Service Mesh and tried Istio may have the following questions: Why does Istio bind Kubernetes? What roles do Kubernetes and Service Mesh play in cloud native? What aspects of Kubernetes has Istio extended? What problems have been solved? What is the relationship between Kubernetes, xDS protocols (Envoy , MOSN, etc) and Istio? Should I use Service Mesh? In this section, we will try to guide you through","title":"Service Mesh - the Microservices in Post Kubernetes Era"},{"categories":["Istio"],"date":1652360939,"description":"This blog describes the sidecar pattern, transparent traffic hijacking and routing.","image":"https://jimmysong.ioimages/banner/istio-hijacking.webp","objectID":"89a487babf4c0feef0b2156bc89150ab","permalink":"https://jimmysong.io/en/blog/sidecar-injection-iptables-and-traffic-routing/","summary":"Updated on May 6, 2022 Based on Istio version 1.13, this article will present the following. What is the sidecar pattern and what advantages does it have? How are the sidecar injections done in Istio? How does the sidecar proxy do transparent traffic hijacking? How is the traffic routed to upstream? The figure below shows how the productpage service requests access to http://reviews.default.svc.cluster.local:9080/ and how the sidecar proxy inside the reviews service does traffic blocking and routing forwarding when traffic goes inside the reviews service. Sidecar traffic injection At the beginning of the first step, the sidecar in the productpage","tags":["istio","iptables","envoy"],"title":"Sidecar injection, transparent traffic hijacking , and routing process in Istio explained in detail"},{"categories":["Service Mesh"],"date":1639730607,"description":"There is no shortage of debate in the community about the practicability of service mesh and Istio – here’s a list of common questions and concerns, and how to address them.","image":"https://jimmysong.ioimages/banner/sm-debate.webp","objectID":"14a041e32dace24c5c99d88ea0cf028b","permalink":"https://jimmysong.io/en/blog/the-debate-in-the-community-about-istio-and-service-mesh/","summary":"You can use Istio to do multi-cluster management , API Gateway , and manage applications on Kubernetes or virtual machines . In my last blog , I talked about how service mesh is an integral part of cloud native applications. However, building infrastructure can be a big deal. There is no shortage of debate in the community about the practicability of service mesh and Istio– here’s a list of common questions and concerns, and how to address them. Is anyone using Istio in production? What is the impact on application","tags":["istio","service mesh","cloud native"],"title":"The debate in the community about Istio and service mesh"},{"categories":["service mesh"],"date":1545876082,"description":"Details about Envoy sidecar with iptables rules.","image":"https://jimmysong.ioimages/banner/istio-logo.webp","objectID":"2046270f3e9199e21db0410a0c4b15b9","permalink":"https://jimmysong.io/en/blog/understanding-how-envoy-sidecar-intercept-and-route-traffic-in-istio-service-mesh/","summary":"Updated at Mar 8, 2022\nThis article uses Istio\u0026rsquo;s official bookinfo sample to explain how Envoy performs routing forwarding after the traffic entering the Pod and forwarded to Envoy sidecar by iptables, detailing the inbound and outbound processing. For a detailed analysis of traffic interception, see Understanding Envoy Sidecar Proxy Injection and Traffic Interception in Istio Service Mesh .\nThe following is a request flow diagram for bookinfo officially provided by Istio, assuming that the DestinationRule is not configured in all services of the bookinfo application.\n  bookinfo  Overview of Sidecar Injection and Traffic Interception Steps Below is an overview of the steps from Sidecar injection, Pod startup to Sidecar proxy interception traffic and Envoy processing routing.","tags":["envoy","istio"],"title":"Understanding How Envoy Sidecar Intercept and Route Traffic in Istio Service Mesh"},{"categories":["Istio"],"date":1652329120,"description":"This article will give you a brief introduction to iptbles, its tables and the order of execution.","image":"https://jimmysong.ioimages/banner/iptables.webp","objectID":"383e9da990784923cc284eede5c347a3","permalink":"https://jimmysong.io/en/blog/understanding-iptables/","summary":"iptables is an important feature in the Linux kernel and has a wide range of applications. iptables is used by default in Istio for transparent traffic hijacking. Understanding iptables is very important for us to understand how Istio works. This article will give you a brief introduction to iptbles. iptables introduction iptables is a management tool for netfilter, the firewall software in the Linux kernel. netfilter is located in the user space and is part of netfilter. netfilter is located in the kernel space and has not only network address conversion, but also packet content modification and packet filtering firewall","tags":["iptables"],"title":"Understanding iptalbes"},{"categories":["service mesh"],"date":1611275237,"description":"This article will take you through what a service mesh is, as well as its architecture, features, and advantages and disadvantages.","image":"https://jimmysong.io/images/banner/service-mesh-banner.jpg","objectID":"6fdda23fc1958527606457b33205ccb4","permalink":"https://jimmysong.io/en/blog/what-is-a-service-mesh/","summary":"A service mesh is a relatively simple concept, consisting of a bunch of network proxies paired with each service in an application, plus a set of task management processes. The proxies are called the data plane and the management processes are called the control plane in the Service Mesh. The data plane intercepts calls between different services and “processes” them; the control plane is the brain of the mesh that coordinates the behavior of proxies and provides APIs for operations and maintenance personnel to manipulate and observe the entire network.\nThe diagram below shows the architecture of a service mesh.","title":"What is a service mesh?"},{"categories":["istio"],"date":1619571974,"description":"This article will explain how Istio came about and what it is in relation to Kubernetes.","image":"https://jimmysong.io/images/banner/istio-kubernetes.jpg","objectID":"d4406e4dc933ff76c156c2553558a24d","permalink":"https://jimmysong.io/en/blog/what-is-istio-and-why-does-kubernetes-need-it/","summary":"Istio, the most popular service mesh implementation , was developed on top of Kubernetes and has a different niche in the cloud native application ecosystem than Kubernetes. Rather than introduce you directly to what Istio has to offer, this article will explain how Istio came about and what it is in relation to Kubernetes.\nWhy Is There an Istio? To explain what Istio is, it’s also important to understand the context in which Istio came into being — i.e., why is there an Istio?\nMicroservices are a technical solution to an organizational problem. And Kubernetes/Istio are a technical solution to deal with the issues created by moving to microservices.","tags":["istio","kubernetes"],"title":"What Is Istio and Why Does Kubernetes Need it?"},{"categories":["Istio"],"date":1648457007,"description":"In February 2022, Istio released 1.13.0 and 1.13.1. This blog will give you an overview of what’s new in these two releases.","image":"https://jimmysong.ioimages/banner/istio-113.webp","objectID":"1bcbf876e5a0307aa6fcdb35cbf69449","permalink":"https://jimmysong.io/en/blog/what-is-new-in-istio-1-13/","summary":"Istio 1.13 is the first release of 2022, and, not surprisingly, the Istio team will continue to release new versions every quarter. Overall, the new features in this release include:\n Support for newer versions of Kubernetes New API – ProxyConfig, for configuring sidecar proxies Improved Telemetry API Support for hostname-based load balancers with multiple network gateways  Support for Kubernetes Versions I often see people asking in the community which Istio supports Kubernetes versions. Istio’s website has a clear list of supported Kubernetes versions. You can see here that Istio 1.13 supports Kubernetes versions 1.20, 1.21, 1.22, and 1.23, and has been tested but not officially supported in Kubernetes 1.","tags":["istio","service mesh"],"title":"What's new in Istio 1.13?"},{"categories":["istio"],"date":1617755237,"description":"This article will take you through the inner workings of Kubernetes and Istio. In addition, I will introduce the load balancing approach in Kubernetes, and explain why you need Istio when you have Kubernetes.","image":"https://jimmysong.io/images/banner/istio-kubernetes.jpg","objectID":"12ba9c7ca2e372f94caeafb4a3f2023d","permalink":"https://jimmysong.io/en/blog/why-do-you-need-istio-when-you-already-have-kubernetes/","summary":"If you’ve heard of service mesh and tried Istio , you may have the following questions:\n Why is Istio running on Kubernetes? What is the role of Kubernetes and a service mesh in the cloud native application architecture, respectively? What aspects of Kubernetes does Istio extend? What problems does it solve? What is the relationship between Kubernetes, Envoy, and Istio?  This article will take you through the inner workings of Kubernetes and Istio. In addition, I will introduce the load balancing approach in Kubernetes, and explain why you need Istio when you have Kubernetes.\nKubernetes is essentially about application lifecycle management through declarative configuration, while a service mesh is essentially about providing inter-application traffic, security management and observability.","tags":["kubernetes","istio","service mesh"],"title":"Why Do You Need Istio When You Already Have Kubernetes?"},{"categories":["service mesh"],"date":1613801560,"description":"This article will introduce you to the next generation permission control model, NGAC, and compare ABAC, RABC, and explain why you should choose NGAC.","image":"https://jimmysong.ioimages/banner/access-control.jpg","objectID":"c72628aecdaf32dff6be6a6c8316904f","permalink":"https://jimmysong.io/en/blog/why-you-should-choose-ngac-as-your-access-control-model/","summary":"Different companies or software providers have devised countless ways to control user access to functions or resources, such as Discretionary Access Control (DAC), Mandatory Access Control (MAC), Role-Based Access Control (RBAC), and Attribute-Based Access Control (ABAC). In essence, whatever the type of access control model, three basic elements can be abstracted: user, system/application, and policy.\nIn this article, we will introduce ABAC, RBAC, and a new access control model — Next Generation Access Control (NGAC) — and compare the similarities and differences between the three, as well as why you should consider NGAC.\nWhat Is RBAC? RBAC, or Role-Based Access Control, takes an approach whereby users are granted (or denied) access to resources based on their role in the organization.","tags":["NGAC","RBAC","ABAC"],"title":"Why You Should Choose NGAC as Your Access Control Model"}]